storehouse/models/User.php

SELECT * FROM `yl_user` WHERE `username`='123'
---
    public static function findByUsername($username)
    {
        return self::findOne(['username'=>$username]);

SELECT * FROM `yl_user` WHERE `id`='4'
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);